{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 92,
   "id": "b976b997-0eaf-4b7a-bda5-4f857791c29e",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import json\n",
    "import re\n",
    "import random\n",
    "from tqdm import tqdm\n",
    "\n",
    "os.environ['OPENAI_API_KEY'] = \"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "7cfa10bd-f299-4a65-b8da-b4a38ae6fe7a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Hello! How can I assist you today?\n"
     ]
    }
   ],
   "source": [
    "from openai import OpenAI\n",
    "\n",
    "\n",
    "client = OpenAI()\n",
    "\n",
    "completion = client.chat.completions.create(\n",
    "  model=\"gpt-4-1106-preview\",\n",
    "    logprobs=True, top_logprobs=5,\n",
    "  messages=[\n",
    "    {\"role\": \"system\", \"content\": \"You are a helpful assistant.\"},\n",
    "    {\"role\": \"user\", \"content\": \"Hello!\"}\n",
    "  ]\n",
    ")\n",
    "\n",
    "print(completion.choices[0].message.content)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 78,
   "id": "26aa8124-c6df-4ceb-ade5-ae7f7c8585ab",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    },
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\"{'P155': 'предыдущее по порядку', 'P1830': 'владеет', 'P2579': 'изучается дисциплиной', 'P569': 'др', 'P1365': 'заменил', 'P576': 'дата прекращения существования', 'P1884': 'цвет волос', 'P885': 'источник воды', 'P25': 'мать', 'P1303': 'музыкальный инструмент', 'P31': 'это частный случай понятия', 'P5096': 'член экипажа', 'P676': 'автор слов', 'P176': 'изготовитель', 'P279': 'гипоним от', 'P156': 'next', 'P1346': 'победительница', 'P931': 'обслуживаемый город', 'P84': 'архитектор', 'P131': 'административно-территориальная единица', 'P108': 'работодатель', 'P274': 'химическая формула', 'P509': 'метод убийства', 'P2047': 'длительность', 'P823': 'выступающая', 'P2053': 'бассейн водоёма', 'P1448': 'официальное название', 'P1344': 'принял(а) участие в', 'P522': 'тип орбиты', 'P2079': 'изготавливается посредством или с помощью', 'P2551': 'использованный метр', 'P36': 'столица', 'P921': 'основная тема', 'P642': 'относится к', 'P106': 'род занятий', 'P17': 'государство', 'P571': 'дата основания, создания, возникновения', 'P1071': 'место производства', 'P111': 'измеряемая величина', 'P87': 'автор либретто', 'P272': 'производящая компания', 'P21': 'пол или гендер', 'P88': 'заказчик произведения', 'P453': 'играет роль персонажа', 'P6': 'глава администрации самоуправляемой территории', 'P1686': 'за произведение', 'P178': 'разработчица', 'P2044': 'высота над уровнем моря', 'P119': 'место погребения', 'P101': 'область деятельности', 'P585': 'момент времени', 'P937': 'место активности', 'P941': 'вдохновлено', 'P1880': 'шкала измерения', 'P40': 'дети', 'P749': 'материнская компания', 'P3373': 'сиблинг', 'P417': 'святая покровительница', 'P828': 'причиной является', 'P61': 'первооткрыватель или изобретатель', 'P2043': 'длина', 'P19': 'мр', 'P50': 'писатель', 'P577': 'дата публикации', 'P195': 'хранится в коллекции', 'P412': 'тембр', 'P140': 'религия или мировоззрение', 'P144': 'создано на основе', 'P58': 'автор сценария', 'P157': 'кто убил', 'P102': 'член политической партии', 'P1050': 'болезни', 'P1269': 'тематически относится к', 'P122': 'форма правления', 'P53': 'род', 'P1101': 'этажей', 'P729': 'введено', 'P69': 'учебное заведение', 'P172': 'раса', 'P2348': 'эра', 'P425': 'соответствует деятельности', 'P610': 'наивысшая точка', 'P366': 'используется в качестве', 'P421': 'часовой пояс', 'P734': 'фамилия', 'P582': 'окончание', 'P2283': 'использует предмет', 'P527': 'состоит из', 'P451': 'бойфренд', 'P1477': 'имя при рождении', 'P4934': 'вычисляется из', 'P1113': 'количество эпизодов', 'P501': 'анклав в', 'P1366': 'заменён на', 'P495': 'страна происхождения', 'P1165': 'родной мир', 'P103': 'говорит на языке', 'P1027': 'вручается кем', 'P1382': 'частично совпадает с', 'P135': 'школа (движение)', 'P2067': 'масса', 'P1419': 'имеет форму', 'P306': 'ОС', 'P674': 'персонажи', 'P186': 'материал', 'P4647': 'место первого исполнения', 'P4969': 'производная работа', 'P459': 'метод определения', 'P403': 'впадает в', 'P393': 'номер издания', 'P4770': 'является гидратированной формой', 'P735': 'личное имя', 'P2056': 'удельная теплоёмкость', 'P2225': 'расход воды', 'P59': 'созвездие', 'P1449': 'перифраз', 'P2578': 'предмет изучения', 'P1853': 'группа крови', 'P150': 'административно делится на', 'P2416': 'спортивная дисциплина', 'P161': 'в ролях', 'P463': 'участник организации или коллектива', 'P1545': 'позиция', 'P123': 'издатель', 'P800': 'известная работа', 'P570': 'дата смерти', 'P2437': 'число сезонов', 'P607': 'война/сражение', 'P1412': 'языки, на которых говорит или пишет персона', 'P793': 'ключевое событие', 'P26': 'супруг(а)', 'P1056': 'продукция', 'P282': 'письменность', 'P206': 'находится в акватории или на берегу водоёма', 'P57': 'режиссёр', 'P38': 'денежная единица', 'P2048': 'высота/рост', 'P241': 'войска', 'P175': 'артист', 'P2101': 'температура плавления', 'P276': 'местонахождение', 'P112': 'основатель', 'P54': 'член спортивной команды', 'P3095': 'практикуется', 'P1429': 'питомец', 'P2068': 'теплопроводность', 'P1557': 'определяющее свойство: [Defining property:]', 'P166': 'полученные награды', 'P3716': 'социальный класс', 'P1876': 'корабль', 'P149': 'архитектурный стиль', 'P376': 'на астрономическом теле', 'P410': 'воинское звание', 'P170': 'создатель', 'P361': 'холоним', 'P580': 'дата начала', 'P344': 'кинооператор', 'P1114': 'число объектов', 'P740': 'место появления', 'P3091': 'верховое животное', 'P6886': 'письменный язык', 'P201': 'вытекают', 'P97': 'титул', 'P991': 'победившая кандидатка', 'P1088': 'твёрдость по шкале Мооса', 'P725': 'роли озвучивали', 'P460': 'предположительно одно и то же с', 'P2583': 'расстояние от Земли', 'P1619': 'дата официального открытия', 'P1249': 'впервые упоминается', 'P2102': 'точка кипения', 'P457': 'де юре на основании', 'P37': 'язык (государственный)', 'P708': 'диоцез', 'P1342': 'число мест в законодательном органе власти', 'P1181': 'числовое значение', 'P86': 'композитор', 'P4000': 'имеет плод типа', 'P1086': 'атомный номер', 'P2789': 'дороги соединения', 'P710': 'участник(и)', 'P837': 'день в году для периодических событий', 'P138': 'названо в честь', 'P2054': 'плотность', 'P2936': 'язык общения', 'P275': 'лицензия', 'P1376': 'является административным центром', 'P407': 'язык произведения или названия', 'P2556': 'диаметр цилиндра', 'P371': 'ведущий теле- или радиопередачи', 'P450': 'летал на', 'P27': 'гражданство', 'P30': 'часть света', 'P669': 'улица', 'P488': 'руководитель', 'P183': 'является эндемиком в', 'P706': 'местоположение:', 'P398': 'тело-спутник', 'P551': 'место проживания', 'P1441': 'представлено в работе', 'P22': 'батько', 'P180': 'изображённый объект', 'P641': 'вид спорта', 'P4511': 'вертикальная глубина', 'P118': 'выступал в лиге', 'P840': 'действие происходит в месте', 'P619': 'дата запуска космического аппарата', 'P915': 'место съёмок', 'P1132': 'всего участников', 'P942': 'музыкальная тема', 'P462': 'цвет', 'P559': 'конечная', 'P171': 'ближайший вышележащий таксон', 'P39': 'занимаемая должность', 'P413': 'амплуа игрока', 'P159': 'расположение штаб-квартиры', 'P974': 'впадают', 'P2046': 'площадь', 'P1532': 'выступает за страну', 'P8111': 'рекомендуемая единица измерения', 'P2575': 'измеряет', 'P177': 'проходит над/под', 'P136': 'музыкальный жанр', 'P730': 'дата вывода из эксплуатации', 'P1029': 'члены экипажа', 'P1196': 'род смерти', 'P127': 'владельцем является', 'P1582': 'натуральный продукт таксона', 'P1454': 'организационно-правовая форма', 'P3438': 'обычно используемое транспортное средство', 'P35': 'глава государства', 'P1559': 'имя на языке оригинала', 'P1066': 'обучался у', 'P286': 'главный тренер', 'P98': 'редактор', 'P1476': 'название', 'P2055': 'удельная электрическая проводимость', 'P200': 'впадает', 'P2234': 'объем', 'P742': 'псевдоним', 'P2669': 'дата завершения поддержки', 'P20': 'место смерти', 'P927': 'анатомическая локализация', 'P575': 'дата открытия (изобретения)', 'P400': 'платформа', 'P647': 'задрафтован', 'P2660': 'относительная высота', 'P1191': 'дата первого исполнения', 'P452': 'отрасль', 'P115': 'домашний стадион'}\""
      ]
     },
     "execution_count": 78,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "str(rubq_preds)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 184,
   "id": "1c17bee6-63ac-4b2d-8573-b40e31165454",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(1691, 419, 277)"
      ]
     },
     "execution_count": 184,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "rubq_train = json.load(open(\"/Users/somov-od/Documents/phd/projects/open_kgqa/data/RuBQ/RuBQ_2.0/train_with_aliases.json\", 'r'))\n",
    "rubq_test = json.load(open(\"/Users/somov-od/Documents/phd/projects/open_kgqa/data/RuBQ/RuBQ_2.0/test_with_aliases.json\", 'r'))\n",
    "rubq_preds = json.load(open(\"/Users/somov-od/Documents/phd/projects/open_kgqa/data/RuBQ/RuBQ_2.0/rubq_english_preds_description.json\", 'r'))\n",
    "len(rubq_train), len(rubq_test), len(rubq_preds)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 142,
   "id": "ca1d82f8-9823-4dbb-9e3e-e98aeed1dc47",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    },
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'wdt:P155': 'предыдущее по порядку',\n",
       " 'wdt:P1830': 'владеет',\n",
       " 'wdt:P2579': 'изучается дисциплиной',\n",
       " 'wdt:P569': 'др',\n",
       " 'wdt:P1365': 'заменил',\n",
       " 'wdt:P576': 'дата прекращения существования',\n",
       " 'wdt:P1884': 'цвет волос',\n",
       " 'wdt:P885': 'источник воды',\n",
       " 'wdt:P25': 'мать',\n",
       " 'wdt:P1303': 'музыкальный инструмент',\n",
       " 'wdt:P31': 'это частный случай понятия',\n",
       " 'wdt:P5096': 'член экипажа',\n",
       " 'wdt:P676': 'автор слов',\n",
       " 'wdt:P176': 'изготовитель',\n",
       " 'wdt:P279': 'гипоним от',\n",
       " 'wdt:P156': 'next',\n",
       " 'wdt:P1346': 'победительница',\n",
       " 'wdt:P931': 'обслуживаемый город',\n",
       " 'wdt:P84': 'архитектор',\n",
       " 'wdt:P131': 'административно-территориальная единица',\n",
       " 'wdt:P108': 'работодатель',\n",
       " 'wdt:P274': 'химическая формула',\n",
       " 'wdt:P509': 'метод убийства',\n",
       " 'wdt:P2047': 'длительность',\n",
       " 'wdt:P823': 'выступающая',\n",
       " 'wdt:P2053': 'бассейн водоёма',\n",
       " 'wdt:P1448': 'официальное название',\n",
       " 'wdt:P1344': 'принял(а) участие в',\n",
       " 'wdt:P522': 'тип орбиты',\n",
       " 'wdt:P2079': 'изготавливается посредством или с помощью',\n",
       " 'wdt:P2551': 'использованный метр',\n",
       " 'wdt:P36': 'столица',\n",
       " 'wdt:P921': 'основная тема',\n",
       " 'wdt:P642': 'относится к',\n",
       " 'wdt:P106': 'род занятий',\n",
       " 'wdt:P17': 'государство',\n",
       " 'wdt:P571': 'дата основания, создания, возникновения',\n",
       " 'wdt:P1071': 'место производства',\n",
       " 'wdt:P111': 'измеряемая величина',\n",
       " 'wdt:P87': 'автор либретто',\n",
       " 'wdt:P272': 'производящая компания',\n",
       " 'wdt:P21': 'пол или гендер',\n",
       " 'wdt:P88': 'заказчик произведения',\n",
       " 'wdt:P453': 'играет роль персонажа',\n",
       " 'wdt:P6': 'глава администрации самоуправляемой территории',\n",
       " 'wdt:P1686': 'за произведение',\n",
       " 'wdt:P178': 'разработчица',\n",
       " 'wdt:P2044': 'высота над уровнем моря',\n",
       " 'wdt:P119': 'место погребения',\n",
       " 'wdt:P101': 'область деятельности',\n",
       " 'wdt:P585': 'момент времени',\n",
       " 'wdt:P937': 'место активности',\n",
       " 'wdt:P941': 'вдохновлено',\n",
       " 'wdt:P1880': 'шкала измерения',\n",
       " 'wdt:P40': 'дети',\n",
       " 'wdt:P749': 'материнская компания',\n",
       " 'wdt:P3373': 'сиблинг',\n",
       " 'wdt:P417': 'святая покровительница',\n",
       " 'wdt:P828': 'причиной является',\n",
       " 'wdt:P61': 'первооткрыватель или изобретатель',\n",
       " 'wdt:P2043': 'длина',\n",
       " 'wdt:P19': 'мр',\n",
       " 'wdt:P50': 'писатель',\n",
       " 'wdt:P577': 'дата публикации',\n",
       " 'wdt:P195': 'хранится в коллекции',\n",
       " 'wdt:P412': 'тембр',\n",
       " 'wdt:P140': 'религия или мировоззрение',\n",
       " 'wdt:P144': 'создано на основе',\n",
       " 'wdt:P58': 'автор сценария',\n",
       " 'wdt:P157': 'кто убил',\n",
       " 'wdt:P102': 'член политической партии',\n",
       " 'wdt:P1050': 'болезни',\n",
       " 'wdt:P1269': 'тематически относится к',\n",
       " 'wdt:P122': 'форма правления',\n",
       " 'wdt:P53': 'род',\n",
       " 'wdt:P1101': 'этажей',\n",
       " 'wdt:P729': 'введено',\n",
       " 'wdt:P69': 'учебное заведение',\n",
       " 'wdt:P172': 'раса',\n",
       " 'wdt:P2348': 'эра',\n",
       " 'wdt:P425': 'соответствует деятельности',\n",
       " 'wdt:P610': 'наивысшая точка',\n",
       " 'wdt:P366': 'используется в качестве',\n",
       " 'wdt:P421': 'часовой пояс',\n",
       " 'wdt:P734': 'фамилия',\n",
       " 'wdt:P582': 'окончание',\n",
       " 'wdt:P2283': 'использует предмет',\n",
       " 'wdt:P527': 'состоит из',\n",
       " 'wdt:P451': 'бойфренд',\n",
       " 'wdt:P1477': 'имя при рождении',\n",
       " 'wdt:P4934': 'вычисляется из',\n",
       " 'wdt:P1113': 'количество эпизодов',\n",
       " 'wdt:P501': 'анклав в',\n",
       " 'wdt:P1366': 'заменён на',\n",
       " 'wdt:P495': 'страна происхождения',\n",
       " 'wdt:P1165': 'родной мир',\n",
       " 'wdt:P103': 'говорит на языке',\n",
       " 'wdt:P1027': 'вручается кем',\n",
       " 'wdt:P1382': 'частично совпадает с',\n",
       " 'wdt:P135': 'школа (движение)',\n",
       " 'wdt:P2067': 'масса',\n",
       " 'wdt:P1419': 'имеет форму',\n",
       " 'wdt:P306': 'ОС',\n",
       " 'wdt:P674': 'персонажи',\n",
       " 'wdt:P186': 'материал',\n",
       " 'wdt:P4647': 'место первого исполнения',\n",
       " 'wdt:P4969': 'производная работа',\n",
       " 'wdt:P459': 'метод определения',\n",
       " 'wdt:P403': 'впадает в',\n",
       " 'wdt:P393': 'номер издания',\n",
       " 'wdt:P4770': 'является гидратированной формой',\n",
       " 'wdt:P735': 'личное имя',\n",
       " 'wdt:P2056': 'удельная теплоёмкость',\n",
       " 'wdt:P2225': 'расход воды',\n",
       " 'wdt:P59': 'созвездие',\n",
       " 'wdt:P1449': 'перифраз',\n",
       " 'wdt:P2578': 'предмет изучения',\n",
       " 'wdt:P1853': 'группа крови',\n",
       " 'wdt:P150': 'административно делится на',\n",
       " 'wdt:P2416': 'спортивная дисциплина',\n",
       " 'wdt:P161': 'в ролях',\n",
       " 'wdt:P463': 'участник организации или коллектива',\n",
       " 'wdt:P1545': 'позиция',\n",
       " 'wdt:P123': 'издатель',\n",
       " 'wdt:P800': 'известная работа',\n",
       " 'wdt:P570': 'дата смерти',\n",
       " 'wdt:P2437': 'число сезонов',\n",
       " 'wdt:P607': 'война/сражение',\n",
       " 'wdt:P1412': 'языки, на которых говорит или пишет персона',\n",
       " 'wdt:P793': 'ключевое событие',\n",
       " 'wdt:P26': 'супруг(а)',\n",
       " 'wdt:P1056': 'продукция',\n",
       " 'wdt:P282': 'письменность',\n",
       " 'wdt:P206': 'находится в акватории или на берегу водоёма',\n",
       " 'wdt:P57': 'режиссёр',\n",
       " 'wdt:P38': 'денежная единица',\n",
       " 'wdt:P2048': 'высота/рост',\n",
       " 'wdt:P241': 'войска',\n",
       " 'wdt:P175': 'артист',\n",
       " 'wdt:P2101': 'температура плавления',\n",
       " 'wdt:P276': 'местонахождение',\n",
       " 'wdt:P112': 'основатель',\n",
       " 'wdt:P54': 'член спортивной команды',\n",
       " 'wdt:P3095': 'практикуется',\n",
       " 'wdt:P1429': 'питомец',\n",
       " 'wdt:P2068': 'теплопроводность',\n",
       " 'wdt:P1557': 'определяющее свойство: [Defining property:]',\n",
       " 'wdt:P166': 'полученные награды',\n",
       " 'wdt:P3716': 'социальный класс',\n",
       " 'wdt:P1876': 'корабль',\n",
       " 'wdt:P149': 'архитектурный стиль',\n",
       " 'wdt:P376': 'на астрономическом теле',\n",
       " 'wdt:P410': 'воинское звание',\n",
       " 'wdt:P170': 'создатель',\n",
       " 'wdt:P361': 'холоним',\n",
       " 'wdt:P580': 'дата начала',\n",
       " 'wdt:P344': 'кинооператор',\n",
       " 'wdt:P1114': 'число объектов',\n",
       " 'wdt:P740': 'место появления',\n",
       " 'wdt:P3091': 'верховое животное',\n",
       " 'wdt:P6886': 'письменный язык',\n",
       " 'wdt:P201': 'вытекают',\n",
       " 'wdt:P97': 'титул',\n",
       " 'wdt:P991': 'победившая кандидатка',\n",
       " 'wdt:P1088': 'твёрдость по шкале Мооса',\n",
       " 'wdt:P725': 'роли озвучивали',\n",
       " 'wdt:P460': 'предположительно одно и то же с',\n",
       " 'wdt:P2583': 'расстояние от Земли',\n",
       " 'wdt:P1619': 'дата официального открытия',\n",
       " 'wdt:P1249': 'впервые упоминается',\n",
       " 'wdt:P2102': 'точка кипения',\n",
       " 'wdt:P457': 'де юре на основании',\n",
       " 'wdt:P37': 'язык (государственный)',\n",
       " 'wdt:P708': 'диоцез',\n",
       " 'wdt:P1342': 'число мест в законодательном органе власти',\n",
       " 'wdt:P1181': 'числовое значение',\n",
       " 'wdt:P86': 'композитор',\n",
       " 'wdt:P4000': 'имеет плод типа',\n",
       " 'wdt:P1086': 'атомный номер',\n",
       " 'wdt:P2789': 'дороги соединения',\n",
       " 'wdt:P710': 'участник(и)',\n",
       " 'wdt:P837': 'день в году для периодических событий',\n",
       " 'wdt:P138': 'названо в честь',\n",
       " 'wdt:P2054': 'плотность',\n",
       " 'wdt:P2936': 'язык общения',\n",
       " 'wdt:P275': 'лицензия',\n",
       " 'wdt:P1376': 'является административным центром',\n",
       " 'wdt:P407': 'язык произведения или названия',\n",
       " 'wdt:P2556': 'диаметр цилиндра',\n",
       " 'wdt:P371': 'ведущий теле- или радиопередачи',\n",
       " 'wdt:P450': 'летал на',\n",
       " 'wdt:P27': 'гражданство',\n",
       " 'wdt:P30': 'часть света',\n",
       " 'wdt:P669': 'улица',\n",
       " 'wdt:P488': 'руководитель',\n",
       " 'wdt:P183': 'является эндемиком в',\n",
       " 'wdt:P706': 'местоположение:',\n",
       " 'wdt:P398': 'тело-спутник',\n",
       " 'wdt:P551': 'место проживания',\n",
       " 'wdt:P1441': 'представлено в работе',\n",
       " 'wdt:P22': 'батько',\n",
       " 'wdt:P180': 'изображённый объект',\n",
       " 'wdt:P641': 'вид спорта',\n",
       " 'wdt:P4511': 'вертикальная глубина',\n",
       " 'wdt:P118': 'выступал в лиге',\n",
       " 'wdt:P840': 'действие происходит в месте',\n",
       " 'wdt:P619': 'дата запуска космического аппарата',\n",
       " 'wdt:P915': 'место съёмок',\n",
       " 'wdt:P1132': 'всего участников',\n",
       " 'wdt:P942': 'музыкальная тема',\n",
       " 'wdt:P462': 'цвет',\n",
       " 'wdt:P559': 'конечная',\n",
       " 'wdt:P171': 'ближайший вышележащий таксон',\n",
       " 'wdt:P39': 'занимаемая должность',\n",
       " 'wdt:P413': 'амплуа игрока',\n",
       " 'wdt:P159': 'расположение штаб-квартиры',\n",
       " 'wdt:P974': 'впадают',\n",
       " 'wdt:P2046': 'площадь',\n",
       " 'wdt:P1532': 'выступает за страну',\n",
       " 'wdt:P8111': 'рекомендуемая единица измерения',\n",
       " 'wdt:P2575': 'измеряет',\n",
       " 'wdt:P177': 'проходит над/под',\n",
       " 'wdt:P136': 'музыкальный жанр',\n",
       " 'wdt:P730': 'дата вывода из эксплуатации',\n",
       " 'wdt:P1029': 'члены экипажа',\n",
       " 'wdt:P1196': 'род смерти',\n",
       " 'wdt:P127': 'владельцем является',\n",
       " 'wdt:P1582': 'натуральный продукт таксона',\n",
       " 'wdt:P1454': 'организационно-правовая форма',\n",
       " 'wdt:P3438': 'обычно используемое транспортное средство',\n",
       " 'wdt:P35': 'глава государства',\n",
       " 'wdt:P1559': 'имя на языке оригинала',\n",
       " 'wdt:P1066': 'обучался у',\n",
       " 'wdt:P286': 'главный тренер',\n",
       " 'wdt:P98': 'редактор',\n",
       " 'wdt:P1476': 'название',\n",
       " 'wdt:P2055': 'удельная электрическая проводимость',\n",
       " 'wdt:P200': 'впадает',\n",
       " 'wdt:P2234': 'объем',\n",
       " 'wdt:P742': 'псевдоним',\n",
       " 'wdt:P2669': 'дата завершения поддержки',\n",
       " 'wdt:P20': 'место смерти',\n",
       " 'wdt:P927': 'анатомическая локализация',\n",
       " 'wdt:P575': 'дата открытия (изобретения)',\n",
       " 'wdt:P400': 'платформа',\n",
       " 'wdt:P647': 'задрафтован',\n",
       " 'wdt:P2660': 'относительная высота',\n",
       " 'wdt:P1191': 'дата первого исполнения',\n",
       " 'wdt:P452': 'отрасль',\n",
       " 'wdt:P115': 'домашний стадион'}"
      ]
     },
     "execution_count": 142,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "rubq_preds"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 66,
   "id": "e8144bca-7d79-485d-ad7d-b1d8d335e126",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "391\n",
      "All good samples\n"
     ]
    }
   ],
   "source": [
    "appropriate_rubq_test_samples = []\n",
    "for sample in rubq_test:\n",
    "    if sample['query'] and len(sample['id2alias'])>0:\n",
    "        appropriate_rubq_test_samples.append(sample)\n",
    "        \n",
    "print(len(appropriate_rubq_test_samples))\n",
    "\n",
    "chat_gpt_test_subsample = random.sample(appropriate_rubq_test_samples, 100)\n",
    "len(chat_gpt_test_subsample)\n",
    "\n",
    "# check\n",
    "for sample in chat_gpt_test_subsample:\n",
    "    if sample['query'] and len(sample['id2alias'])>0:\n",
    "        continue\n",
    "    else:\n",
    "        print('Error')\n",
    "        break\n",
    "print('All good samples')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 158,
   "id": "51b7217a-4c4a-4337-94b2-78791098143b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total RUBQ train templates:  100\n",
      "Total RUBQ test templates:  36\n",
      "Total RUBQ test templates:  26\n"
     ]
    }
   ],
   "source": [
    "# lets look of the templates in input\n",
    "\n",
    "def generate_template(sparql):\n",
    "    predicates = re.findall(r\"\\S*:P\\d+(?:\\+|\\*)?\", sparql)\n",
    "    ids = re.findall(r\"\\S*Q\\d+\", sparql)\n",
    "\n",
    "    for idx, pred in enumerate(predicates):\n",
    "        sparql = sparql.replace(pred, f\"PRED_{idx}\")\n",
    "\n",
    "    for idx, wikidata_id in enumerate(ids):\n",
    "        sparql = sparql.replace(wikidata_id, f\"ENTITY_{idx}\")\n",
    "\n",
    "    sparql = sparql.replace('\\n', \" \")\n",
    "    return sparql\n",
    "\n",
    "rubq_train_templates = set()\n",
    "for sample in rubq_train:\n",
    "    sparql = sample['query']\n",
    "    if sparql:\n",
    "        sparql_template = generate_template(sparql)\n",
    "        rubq_train_templates.add(sparql_template)\n",
    "        \n",
    "        \n",
    "rubq_test_templates = set()\n",
    "for sample in rubq_test:\n",
    "    sparql = sample['query']\n",
    "    if sparql:\n",
    "        sparql_template = generate_template(sparql)\n",
    "        rubq_test_templates.add(sparql_template)\n",
    "\n",
    "        \n",
    "print('Total RUBQ train templates: ', len(rubq_train_templates))\n",
    "print('Total RUBQ test templates: ', len(rubq_test_templates))\n",
    "print('Total RUBQ test templates: ', len(rubq_train_templates.intersection(rubq_test_templates)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 187,
   "id": "8a52c3eb-b1f3-41ed-b183-0d9f60d25592",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    },
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'wdt:P403': 'the body of water to which the watercourse drains',\n",
       " 'wdt:P559': 'the feature (intersecting road, train station, etc.) at the end of a linear feature',\n",
       " 'wdt:P88': 'person or organization that commissioned this work',\n",
       " 'wdt:P1366': 'other person or item which continues the item by replacing it in its role. Use P156 (\"followed by\") if the item is not replaced nor identical, but adds to the series (e.g. books in a series).',\n",
       " 'wdt:P706': 'located on the specified (geo)physical feature. Should not be used when the value is only political/administrative (P131) or a mountain range (P4552).',\n",
       " 'pq:P585': 'date something took place, existed or a statement was true; for providing time use the \"refine date\" property (P4241)',\n",
       " 'wdt:P942': 'the theme music/song used by the item',\n",
       " 'p:P69': 'educational institution attended by subject',\n",
       " 'p:P26': 'the subject has the object as their spouse (husband, wife, partner, etc.). Use \"unmarried partner\" (P451) for non-married companions',\n",
       " 'p:P2046': 'area occupied by an object',\n",
       " 'wdt:P272': 'company that produced this film, audio or performing arts work',\n",
       " 'p:P175': 'actor, musician, band or other performer associated with this role or musical work',\n",
       " 'p:P180': \"entity visually depicted in an image, literarily described in a work, or otherwise incorporated into an audiovisual or other medium; see also P921,  'main subject'\",\n",
       " 'wdt:P1344': 'event in which a person or organization was/is a participant; inverse of P710 or P1923',\n",
       " 'wdt:P840': 'the narrative of the work is set in this location',\n",
       " 'wdt:P156': 'immediately following item in a series of which the subject is a part, preferably use as qualifier of P179 [if the subject has been replaced, e.g. political offices, use \"replaced by\" (P1366)]',\n",
       " 'ps:P1448': 'official name of the subject in its official language(s)',\n",
       " 'wdt:P607': 'battles, wars or other military engagements in which the person or item participated',\n",
       " 'wdt:P1557': 'inherent and characteristic embodiment of a given concept',\n",
       " 'wdt:P25': 'female parent of the subject. For stepmother, use \"stepparent\" (P3448)',\n",
       " 'wdt:P495': 'country of origin of this item (creative work, food, phrase, product, etc.)',\n",
       " 'p:P457': 'text through which an institution or object has been created or established',\n",
       " 'p:P54': 'sports teams or clubs that the subject represents or represented',\n",
       " 'wdt:P2048': 'vertical length of an entity',\n",
       " 'wdt:P570': 'date on which the subject died',\n",
       " 'wdt:P2556': 'cylinder bore represents the size, in terms of diameter, of the cylinder in which a piston travels',\n",
       " 'wdt:P178': 'organization or person that developed the item',\n",
       " 'wdt:P87': 'author of the libretto (words) of an opera, operetta, oratorio or cantata, or of the book of a musical',\n",
       " 'wdt:P1191': 'date a work was first debuted, performed or live-broadcasted',\n",
       " 'wdt:P6': 'head of the executive power of this town, city, municipality, state, country, or other governmental body',\n",
       " 'wdt:P2053': \"size of a stream's watershed (drainage basin)\",\n",
       " 'p:P734': 'part of full name of person',\n",
       " 'wdt:P2575': 'physical quantity that this device measures',\n",
       " 'wdt:P575': 'date or point in time when the item was discovered or invented',\n",
       " 'wdt:P735': 'first name or another given name of this person; values used with the property should not link disambiguations nor family names',\n",
       " 'ps:P36': 'seat of government of a country, province, state or other type of administrative territorial entity',\n",
       " 'wdt:P1449': 'informal name (for a pseudonym use P742)',\n",
       " 'wdt:P69': 'educational institution attended by subject',\n",
       " 'wdt:P3091': 'creature ridden by the subject, for instance a horse',\n",
       " 'wdt:P4511': 'vertical distance from a horizontal area to a point below. Compare with \"horizontal depth\" (P5524)',\n",
       " 'wdt:P1582': 'links a natural product with its source (animal, plant, fungal, algal, etc.)',\n",
       " 'pq:P2079': 'method, process or technique used to grow, cook, weave, build, assemble, manufacture the item',\n",
       " 'wdt:P2101': 'temperature at which a solid changes its state from solid to liquid at atmospheric pressure',\n",
       " 'wdt:P97': 'titles held by the person',\n",
       " 'wdt:P937': 'location where persons or organisations were actively participating in employment, business or other work',\n",
       " 'wdt:P1346': 'winner of a competition or similar event, not to be used for awards (instead use \"award received\" (P166) on awardee\\'s item, possibly qualified with \"for work\" (P1686)) or for wars or battles',\n",
       " 'wdt:P1303': 'musical instrument that a person plays or teaches or used in a music occupation',\n",
       " 'wdt:P1066': 'person who has taught this person',\n",
       " 'wdt:P4969': 'new work of art (film, book, software, etc.) derived from major part of this work',\n",
       " 'wdt:P176': '(main or final) manufacturer or producer of this product',\n",
       " 'wdt:P26': 'the subject has the object as their spouse (husband, wife, partner, etc.). Use \"unmarried partner\" (P451) for non-married companions',\n",
       " 'wdt:P4770': 'given compound is an anhydrous form of this compound',\n",
       " 'wdt:P1876': 'vessel involved in this mission, navigation or event',\n",
       " 'wdt:P569': 'date on which the subject was born',\n",
       " 'wdt:P2579': 'subject is studied by this science or domain',\n",
       " 'wdt:P927': 'where in the body or cell does this feature lie or happen',\n",
       " 'wdt:P4934': 'value of the subject item cannot be measured directly or can be calculated from the following measurands or attributes',\n",
       " 'wdt:P582': 'moment when an entity ceases to exist or a statement stops being valid',\n",
       " 'wdt:P2044': 'height of the item (geographical object) as measured relative to sea level',\n",
       " 'wdt:P941': 'work, human, place or event which inspired this creative work or fictional entity',\n",
       " 'wdt:P501': 'territory is entirely surrounded (enclaved) by the other territory',\n",
       " 'wdt:P4647': 'location where a work was first debuted, performed or broadcasted',\n",
       " 'ps:P457': 'text through which an institution or object has been created or established',\n",
       " 'p:P36': 'seat of government of a country, province, state or other type of administrative territorial entity',\n",
       " 'wdt:P1249': 'first time a subject was mentioned in writing',\n",
       " 'wdt:P112': 'founder or co-founder of this organization, religion, place or entity',\n",
       " 'wdt:P463': 'organization, club or musical group to which the subject belongs. Do not use for membership in ethnic or social groups, nor for holding a political position, such as a member of parliament (use P39 for that)',\n",
       " 'wdt:P460': 'this item is said to be the same as that item, though this may be uncertain or disputed',\n",
       " 'ps:P734': 'part of full name of person',\n",
       " 'wdt:P2583': 'estimated distance to astronomical objects',\n",
       " 'pq:P1545': 'position of an item in its parent series (most frequently a 1-based index), generally to be used as a qualifier (different from \"rank\" defined as a class, and from \"ranking\" defined as a property for evaluating a quality).',\n",
       " 'wdt:P1619': 'date or point in time an event, museum, theater etc. officially opened',\n",
       " 'wdt:P155': 'immediately prior item in a series of which the subject is a part, preferably use as qualifier of P179 [if the subject has replaced the preceding item, e.g. political offices, use \"replaces\" (P1365)]',\n",
       " 'wdt:P150': '(list of) direct subdivisions of an administrative territorial entity',\n",
       " 'wdt:P306': 'operating system (OS) on which a software works or the OS installed on hardware',\n",
       " 'wdt:P27': 'the object is a country that recognizes the subject as its citizen',\n",
       " 'wdt:P1029': 'person(s) that participated operating or serving aboard this vehicle',\n",
       " 'wdt:P1181': 'numerical value of a number, a mathematical constant, or a physical constant',\n",
       " 'wdt:P40': 'subject has object as child. Do not use for stepchildren—use \"relative\" (P1038), qualified with \"type of kinship\" (P1039)',\n",
       " 'pq:P1686': 'qualifier of award received (P166) to specify the work that an award was given to the creator for',\n",
       " 'wdt:P2936': 'language widely used (spoken or written) in this place or at this event or organisation',\n",
       " 'wdt:P1113': 'number of episodes in a film/TV/radio series',\n",
       " 'wdt:P1477': 'full name of a person at birth, if different from their current, generally used name',\n",
       " 'wdt:P641': 'sport that the subject participates or participated in or is associated with',\n",
       " 'wdt:P1476': 'published name of a work, such as a newspaper article, a literary work, piece of music, a website, or a performance work',\n",
       " 'wdt:P571': 'time when an entity begins to exist; for date of official opening use P1619',\n",
       " 'ps:P39': 'subject currently or formerly holds the object position or public office',\n",
       " 'p:P39': 'subject currently or formerly holds the object position or public office',\n",
       " 'wdt:P35': 'official with the highest formal authority in a country/state',\n",
       " 'wdt:P2660': 'height of a mountain or hill relative to the lowest contour line encircling it (on Earth, maximum 8,848 m)',\n",
       " 'wdt:P619': 'date of spacecraft launch in UTC',\n",
       " 'wdt:P38': 'currency used by item',\n",
       " 'wdt:P2047': 'length of time of an event or process',\n",
       " 'wdt:P931': 'territorial entity or entities served by this transport hub (airport, train station, etc.)',\n",
       " 'wdt:P551': 'the place where the person is or has been, resident',\n",
       " 'wdt:P451': 'someone with whom the person is in a relationship without being married. Use \"spouse\" (P26) for married couples',\n",
       " 'wdt:P149': 'architectural style of a structure',\n",
       " 'wdt:P2974': 'the natural environment in which an organism lives, or the physical environment that surrounds a species population',\n",
       " 'p:P1346': 'winner of a competition or similar event, not to be used for awards (instead use \"award received\" (P166) on awardee\\'s item, possibly qualified with \"for work\" (P1686)) or for wars or battles',\n",
       " 'wdt:P59': 'the area of the celestial sphere of which the subject is a part (from a scientific standpoint, not an astrological one)',\n",
       " 'wdt:P138': 'entity or event that inspired the subject\\'s name, or namesake (in at least one language). Qualifier \"applies to name\" (P5168) can be used to indicate which one',\n",
       " 'wdt:P106': 'occupation of a person; see also \"field of work\" (Property:P101), \"position held\" (Property:P39)',\n",
       " 'wdt:P725': 'performer of a spoken role in a creative work such as animation, video game, radio drama, or dubbing over [use \"character role\" (P453) as qualifier] [use \"cast member\" (P161) for live acting]',\n",
       " 'wdt:P206': 'body of water on or next to which a place is located',\n",
       " 'wdt:P1884': \"person's hair color. Use P585 as qualifier if there's more than one value\",\n",
       " 'p:P2048': 'vertical length of an entity',\n",
       " 'wdt:P2043': 'measured dimension of an object',\n",
       " 'wdt:P22': 'male parent of the subject. For stepfather, use \"stepparent\" (P3448)',\n",
       " 'wdt:P2067': 'mass (in colloquial usage also known as weight) of the item',\n",
       " 'wdt:P50': 'main creator(s) of a written work (use on works, not humans); use P2093 (author name string) when Wikidata item is unknown or does not exist',\n",
       " 'wdt:P509': \"underlying or immediate cause of death.  Underlying cause (e.g. car accident, stomach cancer) preferred. Use 'manner of death' (P1196) for broadest category, e.g. natural causes, accident, homicide, suicide\",\n",
       " 'wdt:P522': 'orbit a satellite has around its central body',\n",
       " 'pq:P580': 'time an entity begins to exist or a statement starts being valid',\n",
       " 'pq:P512': 'academic degree that the person holds',\n",
       " 'wdt:P576': 'point in time at which the subject (organisation, building) ceased to exist;  see \"date of official closure\" (P3999) for closing a facility, \"service retirement\" (P730) for retiring equipment,  \"discontinued date\" (P2669) for stopping a product',\n",
       " 'wdt:P2551': 'rhythmic structure of the poetic text or musical piece',\n",
       " 'wdt:P1086': 'number of protons found in the nucleus of the atom',\n",
       " 'wdt:P170': 'maker of this creative work or other object (where no more specific property exists)',\n",
       " 'wdt:P452': 'specific industry of company or organization',\n",
       " 'wdt:P1830': 'entities owned by the subject',\n",
       " 'wdt:P2055': 'electrical conductivity of a substance with phase of matter and temperature as qualifiers',\n",
       " 'wdt:P58': 'person(s) who wrote the script for subject item',\n",
       " 'wdt:P344': 'person responsible for the framing, lighting, and filtration of the subject work',\n",
       " 'p:P735': 'first name or another given name of this person; values used with the property should not link disambiguations nor family names',\n",
       " 'wdt:P921': 'primary topic of a work (see also P180: depicts)',\n",
       " 'wdt:P674': 'characters which appear in this item (like plays, operas, operettas, books, comics, films, TV series, video games)',\n",
       " 'wdt:P915': 'actual place where this scene/film was shot. For the setting, use \"narrative location\" (P840)',\n",
       " 'wdt:P2068': 'property of a material that describes how efficiently heat is conducted',\n",
       " 'wdt:P417': 'patron saint adopted by the subject',\n",
       " 'wdt:P1853': 'blood type of the human or animal',\n",
       " 'wdt:P180': \"entity visually depicted in an image, literarily described in a work, or otherwise incorporated into an audiovisual or other medium; see also P921,  'main subject'\",\n",
       " 'p:P166': 'award or recognition received by a person, organization or creative work',\n",
       " 'wdt:P172': \"subject's ethnicity (consensus is that a VERY high standard of proof is needed for this field to be used. In general this means 1) the subject claims it themselves, or 2) it is widely agreed on by scholars, or 3) is fictional and portrayed as such)\",\n",
       " 'ps:P175': 'actor, musician, band or other performer associated with this role or musical work',\n",
       " 'wdt:P828': 'underlying cause, entity that ultimately resulted in this effect',\n",
       " 'pq:P582': 'moment when an entity ceases to exist or a statement stops being valid',\n",
       " 'wdt:P729': 'date or point in time on which a piece or class of equipment entered operational service',\n",
       " 'wdt:P17': 'sovereign state that this item is in (not to be used for human beings)',\n",
       " 'wdt:P135': 'literary, artistic, scientific or philosophical movement or scene associated with this person or work. For political ideologies use P1142.',\n",
       " 'wdt:P669': 'street, road, or square, where the item is located. To add the number, use Property:P670 \"house number\" as qualifier. Use property P6375 \"street address\", if there is no item for the street',\n",
       " 'wdt:P1101': 'above ground floor count of a building (ground floor and attic included)',\n",
       " 'wdt:P1429': 'pet that a person owns',\n",
       " 'wdt:P3095': 'type of agents that study this subject or work in this field',\n",
       " 'wdt:P201': 'rivers and other outflows waterway names. If evaporation or seepage are notable outflows, they may be included. Some terms may not be place names, e.g. evaporation',\n",
       " 'wdt:P159': \"city or town where an organization's headquarters is or has been situated. Use P276 qualifier for specific building\",\n",
       " 'wdt:P1283': 'item for the list of films a person has contributed to. Don\\'t use it to add film items. Instead, add actors as \"cast member\" (P161) on items for films, directors with \"director\" (P57)',\n",
       " 'wdt:P119': 'location of grave, resting place, place of ash-scattering, etc. (e.g., town/city or cemetery) for a person or animal. There may be several places: e.g., re-burials, parts of body buried separately.',\n",
       " 'wdt:P1545': 'position of an item in its parent series (most frequently a 1-based index), generally to be used as a qualifier (different from \"rank\" defined as a class, and from \"ranking\" defined as a property for evaluating a quality).',\n",
       " 'wdt:P577': 'date or point in time when a work was first published or released',\n",
       " 'wdt:P413': 'position or specialism of a player on a team',\n",
       " 'wdt:P136': \"creative work's genre or an artist's field of work (P101). Use main subject (P921) to relate creative works to their topic\",\n",
       " 'p:P2225': 'volume rate of water flow which is transported through a given cross-sectional area',\n",
       " 'wdt:P2669': 'date that the availability of a product or service was discontinued; see also \"dissolved, abolished or demolished\" (P576) and \"service retirement\" (P730) for pieces or classes of equipment',\n",
       " 'ps:P54': 'sports teams or clubs that the subject represents or represented',\n",
       " 'wdt:P1880': 'scale by which a phenomenon is measured',\n",
       " 'wdt:P1454': 'legal form of an entity',\n",
       " 'wdt:P730': 'date or point in time on which a piece or class of equipment was retired from operational service ; use P2669 for end of a public service',\n",
       " 'wdt:P1165': 'home planet or natural satellite for a fictional character or species',\n",
       " 'wdt:P1365': 'person, state or item replaced. Use \"structure replaces\" (P1398) for structures. Use \"follows\" (P155) if the previous item was not replaced or predecessor and successor are identical',\n",
       " 'wdt:P740': 'location where a group or organization was formed',\n",
       " 'wdt:P393': 'number of an edition (first, second, ... as 1, 2, ...) or event',\n",
       " 'wdt:P36': 'seat of government of a country, province, state or other type of administrative territorial entity',\n",
       " 'wdt:P676': 'author of song lyrics',\n",
       " 'wdt:P183': 'sole location or habitat type where the taxon lives',\n",
       " 'wdt:P102': 'the political party of which a person is or has been a member or otherwise affiliated',\n",
       " 'wdt:P2789': 'item with which the item is physically connected',\n",
       " 'ps:P161': 'actor in the subject production [use \"character role\" (P453) and/or \"name of the character role\" (P4633) as qualifiers] [use \"voice actor\" (P725) for voice-only role]',\n",
       " 'p:P1448': 'official name of the subject in its official language(s)',\n",
       " 'wdt:P412': \"person's voice type. expected values: soprano, mezzo-soprano, contralto, countertenor, tenor, baritone, bass (and derivatives)\",\n",
       " 'wdt:P276': 'location of the object, structure or event. In the case of an administrative entity as containing item use P131. For statistical entities use P8138. In the case of a geographic entity use P706. Use P7153 for locations associated with the object',\n",
       " 'wdt:P103': 'language or languages a person has learned from early childhood',\n",
       " 'wdt:P1027': 'person or organization who grants an award, certification, grant, or role',\n",
       " 'wdt:P800': \"notable scientific, artistic or literary work, or other work of significance among subject's works\",\n",
       " 'wdt:P53': 'family, including dynasty and nobility houses. Not family name (use P734 for family name).',\n",
       " 'wdt:P1559': 'name of a person in their native language',\n",
       " 'wdt:P647': 'which team the player was drafted by',\n",
       " 'wdt:P361': 'object of which the subject is a part (if this subject is already part of object A which is a part of object B, then please only make the subject part of object A), inverse property of \"has part\" (P527, see also \"has parts of the class\" (P2670))',\n",
       " 'wdt:P398': 'minor body that belongs to the item',\n",
       " 'wdt:P19': 'most specific known birth location of a person, animal or fictional character',\n",
       " 'ps:P6': 'head of the executive power of this town, city, municipality, state, country, or other governmental body',\n",
       " 'wdt:P585': 'date something took place, existed or a statement was true; for providing time use the \"refine date\" property (P4241)',\n",
       " 'wdt:P157': 'person or organization who killed the subject',\n",
       " 'wdt:P2054': 'density of a substance with phase of matter and temperature as qualifiers',\n",
       " 'wdt:P610': 'point with highest elevation in a region, or on the path of a race or route',\n",
       " 'wdt:P2102': 'temperature at which a substance changes its phase from liquid to gas (indicate the corresponding pressure as qualifier)',\n",
       " 'wdt:P710': 'person, group of people or organization (object) that actively takes/took part in an event or process (subject).  Preferably qualify with \"object has role\" (P3831). Use P1923 for participants that are teams.',\n",
       " 'wdt:P580': 'time an entity begins to exist or a statement starts being valid',\n",
       " 'wdt:P1132': 'number of participants of an event, e.g. people or groups of people that take part in the event (NO units)',\n",
       " 'wdt:P3716': 'social class as recognized in traditional or state law',\n",
       " 'wdt:P837': 'when a specific holiday or periodic event occurs. Can be used as property or qualifier',\n",
       " 'wdt:P115': 'home stadium or venue of a sports team or applicable performing arts organization',\n",
       " 'wdt:P54': 'sports teams or clubs that the subject represents or represented',\n",
       " 'wdt:P1196': \"general circumstances of a person's death; e.g. natural causes, accident, suicide, homicide, etc.  Use 'cause of death' (P509) for the specific physiological mechanism, e.g. heart attack, trauma, pneumonia etc.\",\n",
       " 'wdt:P20': 'most specific known (e.g. city instead of country, or hospital instead of city) death location of a person, animal or fictional character',\n",
       " 'wdt:P21': 'sex or gender identity of human or animal. For human: male, female, non-binary, intersex, transgender female, transgender male, agender, etc. For animal: male organism, female organism. Groups of same gender use subclass of (P279)',\n",
       " 'wdt:P37': 'language designated as official by this item',\n",
       " 'wdt:P31': 'that class of which this subject is a particular example and member; different from P279 (subclass of); for example: K2 is an instance of mountain; volcano is a subclass of mountain (and an instance of volcanic landform)',\n",
       " 'p:P279': 'this item is a subclass (subset) of that item; all instances of this item are instances of that item; different from P31 (instance of), e.g.: volcano is a subclass of mountain (and an instance of volcanic landform); Everest is an instance of mountain',\n",
       " 'wdt:P200': 'major inflow sources — rivers, aquifers, glacial runoff, etc. Some terms may not be place names, e.g. none',\n",
       " 'wdt:P885': 'main source of a river, stream or lake',\n",
       " 'wdt:P1050': 'any state relevant to the health of an organism, including diseases and positive conditions',\n",
       " 'pq:P459': 'how a value is determined, or the standard by which it is declared',\n",
       " 'p:P527': 'part of this subject; inverse property of \"part of\" (P361). See also \"has parts of the class\" (P2670).',\n",
       " 'wdt:P287': 'person(s) or organization which designed the object',\n",
       " 'wdt:P111': 'value of a physical property expressed as number multiplied by a unit',\n",
       " 'wdt:P131': 'the item is located on the territory of the following administrative entity. Use P276 for specifying locations that are non-administrative places and for items about events. Use P1382 if the item falls only partially into the administrative entity.',\n",
       " 'wdt:P6886': 'language in which the writer has written their work',\n",
       " 'wdt:P1376': 'country, state, department, canton or other administrative division of which the municipality is the governmental seat',\n",
       " 'wdt:P186': 'material the subject or the object is made of or derived from (do not confuse with P10672 which is used for processes)',\n",
       " 'wdt:P108': 'person or organization for which the subject works or worked',\n",
       " 'wdt:P793': 'significant or notable events associated with the subject',\n",
       " 'wdt:P425': 'field corresponding to this occupation or profession (use only for occupations/professions - for people use Property:P101, for companies use P452)',\n",
       " 'wdt:P127': 'owner of the subject',\n",
       " 'wdt:P1448': 'official name of the subject in its official language(s)',\n",
       " 'wdt:P2416': 'discipline an athlete competed in within a sport',\n",
       " 'wdt:P1419': 'shape of an object',\n",
       " 'ps:P1346': 'winner of a competition or similar event, not to be used for awards (instead use \"award received\" (P166) on awardee\\'s item, possibly qualified with \"for work\" (P1686)) or for wars or battles',\n",
       " 'ps:P166': 'award or recognition received by a person, organization or creative work',\n",
       " 'wdt:P2578': 'the object that an academic field studies; distinct from field of work (P101), which is used for human, organization, etc.',\n",
       " 'p:P161': 'actor in the subject production [use \"character role\" (P453) and/or \"name of the character role\" (P4633) as qualifiers] [use \"voice actor\" (P725) for voice-only role]',\n",
       " 'wdt:P1269': 'topic of which this item is an aspect; item that offers a broader perspective on the same topic',\n",
       " 'wdt:P749': 'parent organization of an organization, opposite of subsidiaries (P355)',\n",
       " 'wdt:P1441': 'this (fictional or fictionalized) entity, place, or person appears in that work as part of the narration (use P2860 for works citing other works, P361/P1433 for works being part of other works, P1343 for entities described in non-fictional accounts)',\n",
       " 'wdt:P282': 'alphabet, character set or other system of writing used by a language, word, or text, supported by a typeface',\n",
       " 'pq:P642': '(This property is being deprecated, see details at WD:P642) qualifier stating that a statement applies within the scope of a particular item',\n",
       " 'wdt:P144': 'the work(s) or inputs used as the basis for subject item; for fictional analog use P1074',\n",
       " 'wdt:P991': 'person(s) or political organization(s) elected after the election',\n",
       " 'wdt:P175': 'actor, musician, band or other performer associated with this role or musical work',\n",
       " 'wdt:P421': 'time zone for this item',\n",
       " 'skos:altLabel': 'Property ID not found.',\n",
       " 'wdt:P1088': 'qualitative ordinal scale characterizing scratch resistance of various minerals',\n",
       " 'wdt:P118': 'league or competition in which team or player plays or has played in',\n",
       " 'ps:P735': 'first name or another given name of this person; values used with the property should not link disambiguations nor family names',\n",
       " 'wdt:P2283': 'item or concept used by the subject or in the operation (see also instrument [P1303] and armament [P520])',\n",
       " 'wdt:P279': 'this item is a subclass (subset) of that item; all instances of this item are instances of that item; different from P31 (instance of), e.g.: volcano is a subclass of mountain (and an instance of volcanic landform); Everest is an instance of mountain',\n",
       " 'wdt:P410': 'military or police rank achieved by a person (should usually have a \"start time\" qualifier), or military or police rank associated with a position',\n",
       " 'ps:P527': 'part of this subject; inverse property of \"part of\" (P361). See also \"has parts of the class\" (P2670).',\n",
       " 'wdt:P101': 'specialization of a person or organization; see P106 for the occupation',\n",
       " 'wdt:P122': \"subject's government\",\n",
       " 'wdt:P39': 'subject currently or formerly holds the object position or public office',\n",
       " 'pq:P453': 'specific role played or filled by subject -- use only as qualifier of \"cast member\" (P161), \"voice actor\" (P725)',\n",
       " 'wdt:P1412': 'language(s) that a person or a people speaks, writes or signs, including the native language(s)',\n",
       " 'wdt:P450': 'space mission that the subject is or has been a member of (do not include future missions)',\n",
       " 'wdt:P274': 'description of chemical compound giving element symbols and counts',\n",
       " 'wdt:P2056': 'specific heat capacity of a substance, with phase of matter and temperature as qualifiers',\n",
       " 'wdt:P376': 'single astronomical body on which features or places are situated',\n",
       " 'ps:P26': 'the subject has the object as their spouse (husband, wife, partner, etc.). Use \"unmarried partner\" (P451) for non-married companions',\n",
       " 'wdt:P400': 'platform for which a work was developed or released, or the specific platform version of a software product',\n",
       " 'wdt:P1382': 'object that partially overlaps with the subject in its instances, parts, or members',\n",
       " 'wdt:P4000': 'morphology of the fruit of this taxon, as defined in botany',\n",
       " 'wdt:P366': 'main use of the subject (includes current and former usage)',\n",
       " 'wdt:P241': 'branch to which this military unit, award, office, or person belongs, e.g. Royal Navy',\n",
       " 'wdt:P30': 'continent of which the subject is a part',\n",
       " 'wdt:P1342': 'total number of seats/members in an assembly (legislative house or similar)',\n",
       " 'wdt:P462': 'color of subject',\n",
       " 'wdt:P166': 'award or recognition received by a person, organization or creative work',\n",
       " 'wdt:P2437': 'number of seasons a television or radio series has had',\n",
       " 'wdt:P1056': 'material or product produced or sold by an organization, industry, facility, or process',\n",
       " 'wdt:P2348': 'time period (historic period or era, sports season, theatre season, legislative period etc.) in which the subject occurred or with which it is associated',\n",
       " 'wdt:P61': 'subject who discovered, first described, invented, or developed this discovery or invention or scientific hypothesis or theory',\n",
       " 'rdfs:label': 'Property ID not found.',\n",
       " 'wdt:P275': 'license under which this copyrighted work is released',\n",
       " 'wdt:P140': 'religion of a person, organization or religious building, or associated with this subject',\n",
       " 'wdt:P3373': 'the subject and the object have at least one common parent (brother, sister, etc. including half-siblings); use \"relative\" (P1038) for siblings-in-law (brother-in-law, sister-in-law, etc.) and step-siblings (step-brothers, step-sisters, etc.)',\n",
       " 'wdt:P286': 'on-field manager or head coach of a sports club (not to be confused with a general manager P505, which is not a coaching position) or person',\n",
       " 'wdt:P86': 'person(s) who wrote the music [for lyricist, use \"lyrics by\" (P676)]',\n",
       " 'wdt:P407': 'language associated with this creative work (such as books, shows, songs, broadcasts or websites) or a name (for persons use \"native language\" (P103) and \"languages spoken, written or signed\" (P1412))',\n",
       " 'wdt:P8111': 'unit in which a quantity is measured as recommended by a standard (SI, ISO, IEC, etc.)',\n",
       " 'wdt:P57': 'director(s) of film, TV-series, stageplay, video game or similar',\n",
       " 'wdt:P171': 'closest parent taxon of the taxon in question',\n",
       " 'wdt:P527': 'part of this subject; inverse property of \"part of\" (P361). See also \"has parts of the class\" (P2670).',\n",
       " 'wdt:P2046': 'area occupied by an object',\n",
       " 'wdt:P84': 'person or architectural firm responsible for designing this building',\n",
       " 'wdt:P734': 'part of full name of person',\n",
       " 'p:P6': 'head of the executive power of this town, city, municipality, state, country, or other governmental body',\n",
       " 'wdt:P974': 'watercourse that flows into an other one (for lake inflows use P200)',\n",
       " 'wdt:P161': 'actor in the subject production [use \"character role\" (P453) and/or \"name of the character role\" (P4633) as qualifiers] [use \"voice actor\" (P725) for voice-only role]'}"
      ]
     },
     "execution_count": 187,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "rubq_preds"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 160,
   "id": "59b91b7c-2048-42b7-a1a9-2c9d93e94da4",
   "metadata": {},
   "outputs": [],
   "source": [
    "rubq_templates = \"\\n\".join(rubq_tempalates)\n",
    "instruction = f\"\"\"You are a text-to-SPARQL assistant. You can generate the following SPARQL structures: \n",
    "{rubq_templates}\n",
    "\n",
    "You know the following predicates that can be used in SPARQL:\n",
    "{str(rubq_preds)}\n",
    "Generate a only SPARQL query based on user question Q and given question entities, matched to Wikidata Ids, mentioned as aliases A. \n",
    "Generate SPARQL from a given templates or generate novel grammarly correct SPARQL. \n",
    "Use only provided predicates and only provided entities to generate query. \n",
    "Do not generate anything besides SPARQL query.\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 153,
   "id": "195bad3d-c593-4224-a9c1-23d2e94b0459",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\"{'wd:Q1710170': {'en': ['Tower of Kamyanyets']}}\""
      ]
     },
     "execution_count": 153,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "entity_alias"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 152,
   "id": "348e5012-e732-4ab2-bfdd-e7f5586c8acf",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'```sparql\\nSELECT ?answer WHERE { wd:Q1710170 wdt:P149 ?answer . }\\n```'"
      ]
     },
     "execution_count": 152,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "sample = chat_gpt_test_subsample[0]\n",
    "question = sample['question_eng']\n",
    "entity_alias = str({f\"wd:{wd_id}\":value for wd_id, value in sample['id2alias'].items()})\n",
    "user_question = f\"Q: {question}, Entity aliases: {entity_alias}\"\n",
    "\n",
    "completion = client.chat.completions.create(\n",
    "  model=\"gpt-4-1106-preview\",\n",
    "  messages=[\n",
    "    {\"role\": \"system\", \"content\": instruction},\n",
    "    {\"role\": \"user\", \"content\": user_question}\n",
    "  ]\n",
    ")\n",
    "\n",
    "completion = completion.choices[0].message.content\n",
    "\n",
    "completion"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 155,
   "id": "0c85ca58-988b-485a-bddc-f16e211fee4b",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|██████████████████████████████████████████████████████████████████████████████████████| 100/100 [03:48<00:00,  2.29s/it]\n"
     ]
    }
   ],
   "source": [
    "\n",
    "predicated_requests = []\n",
    "for sample in tqdm(chat_gpt_test_subsample[:]):\n",
    "    question = sample['question_eng']\n",
    "    entity_alias = str({f\"wd:{wd_id}\":value for wd_id, value in sample['id2alias'].items()})\n",
    "    \n",
    "    user_question = f\"Q: {question}, Entity aliases: {entity_alias}\"\n",
    "\n",
    "    completion = client.chat.completions.create(\n",
    "      model=\"gpt-4-1106-preview\",\n",
    "      messages=[\n",
    "        {\"role\": \"system\", \"content\": instruction},\n",
    "        {\"role\": \"user\", \"content\": user_question}\n",
    "      ]\n",
    "    )\n",
    "\n",
    "    completion = completion.choices[0].message.content\n",
    "    \n",
    "    predicated_requests.append(completion)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 161,
   "id": "290e53b9-8e95-4941-ba9f-f15d9c538ab1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "SELECT ?answer WHERE { wd:Q1710170 wdt:P149 ?answer }\n"
     ]
    }
   ],
   "source": [
    "def clean_sparql_query(query):\n",
    "    # Remove leading and trailing whitespace and newlines\n",
    "    query = query.strip()\n",
    "    query = query.replace('sparql', \"\")\n",
    "    query = query.replace(\"```\", \"\").strip()\n",
    "    # Replace multiple whitespaces, newlines, and tabs with a single space\n",
    "    query = re.sub(r'\\s+', ' ', query)\n",
    "    # Ensure proper spacing around curly braces\n",
    "    query = re.sub(r'\\s*{\\s*', ' { ', query)\n",
    "    query = re.sub(r'\\s*}\\s*', ' } ', query)\n",
    "    query = query.replace('.', \"\")\n",
    "    query = list(filter(lambda x: x != '', query.split(\" \")))\n",
    "    query = \" \".join(query)\n",
    "    return query\n",
    "\n",
    "# Example usage:\n",
    "query = '```sparql SELECT ?answer WHERE {  wd:Q1710170 wdt:P149 ?answer . }```'\n",
    "clean_query = clean_sparql_query(query)\n",
    "print(clean_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 163,
   "id": "45f31ce2-f67f-47fa-a880-8b9b14beba73",
   "metadata": {},
   "outputs": [],
   "source": [
    "def compare_sparql_queries(query1, query2):\n",
    "    # Normalize both queries\n",
    "    normalized_query1 = clean_sparql_query(query1)\n",
    "    normalized_query2 = clean_sparql_query(query2)\n",
    "    # Compare normalized queries for exact match\n",
    "    return normalized_query1 == normalized_query2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 165,
   "id": "4e4ac521-40ca-42b5-b78b-82cb8a4698ad",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Pred:  SELECT ?answer WHERE { wd:Q179444 wdt:P206 ?answer ?answer wdt:P31 wd:Q5119 }\n",
      "Gold:  SELECT ?answer WHERE { ?answer wdt:P206 wd:Q179444 ?answer wdt:P31 wd:Q5119 }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q812767 wdt:P17 ?answer }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q812767 wdt:P740 ?answer }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q38111 wdt:P1559 ?answer FILTER (lang(?answer) = \"en\") }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q38111 wdt:P1477 ?answer }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q1865 wdt:P17 ?answer }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q1865 wdt:P1376 ?answer }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { ?answer wdt:P170 wd:Q500951 ?answer wdt:P180 wd:Q500951 }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q500951 wdt:P170 ?answer }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q34216 rdfs:label ?answer FILTER (lang(?answer) = \"en\") }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q34216 rdfs:label ?answer FILTER (lang(?answer) = \"ru\") }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q44301 wdt:P1366 ?answer }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q44301 wdt:P463 ?answer ?answer wdt:P31/wdt:P279 wd:Q215380 }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q3742244 wdt:P569 ?date BIND(YEAR(?date) as ?answer) }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q3742244 wdt:P569 ?date BIND (YEAR(?date) AS ?answer) }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q913311 wdt:P175 ?answer ?answer wdt:P31 wd:Q215380 }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q913311 wdt:P161 ?answer ?answer wdt:P31/wdt:P279* wd:Q215380 }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { ?answer wdt:P50 wd:Q173540 ?answer wdt:P31 wd:Q8261 }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q173540 wdt:P800 ?answer }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { ?answer wdt:P106 wd:Q214917 ?answer wdt:P569 ?birth_date wd:Q882 wdt:P26 ?spouse ?spouse wdt:P22 ?answer wd:Q882 wdt:P569 ?chaplin_birth_date BIND(MONTH(?chaplin_birth_date) + 6/12 AS ?adjusted_chaplin_birth_date) FILTER(MONTH(?birth_date) > ?adjusted_chaplin_birth_date) FILTER(YEAR(?birth_date) = YEAR(?chaplin_birth_date)) } LIMIT 1\n",
      "Gold:  SELECT ?answer WHERE { wd:Q882 wdt:P26 [ wdt:P22 ?answer ] }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q208116 wdt:P50 ?answer ?answer wdt:P50 wd:Q251918 }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q251918 wdt:P676 ?answer FILTER (?answer not in ( wd:Q208116 )) }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q222 rdfs:label ?answer FILTER (lang(?answer) = \"sq\") }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q222 wdt:P17 ?answer }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q3244512 p:P161 [ ps:P161 ?answer ] }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q3244512 wdt:P175 ?answer }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q328079 wdt:P276 ?answer }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q328079 wdt:P276 [ wdt:P131 ?answer ] }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q26428 wdt:P974 ?answer }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q26428 wdt:P403 ?answer }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q123280 wdt:P31 ?answer }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q123280 wdt:P106 ?answer }\n",
      "\n",
      "Pred:  SELECT ?instrument WHERE { wd:Q152043 wdt:P1303 ?instrument }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q152043 wdt:P1303 ?answer }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q193292 wdt:P155 ?answer }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q193292 wdt:P156 ?answer }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q445202 wdt:P641 ?answer }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q445202 wdt:P2416 ?answer }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q488814 wdt:P1346 ?answer }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q488814 wdt:P991 ?answer }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q46602 p:P166 [ ps:P166 ?answer ] }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q46602 wdt:P166 ?answer }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q7747 wdt:P27 ?answer }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q7747 wdt:P172 ?answer }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q41300 wdt:P571 ?date BIND(YEAR(?date) AS ?answer) }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q41300 wdt:P571 ?date BIND (YEAR(?date) AS ?answer) }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { ?answer wdt:P1344 wd:Q48249 FILTER (?answer != wd:Q145) }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q48249 wdt:P710 ?answer FILTER (?answer not in (wd:Q145)) }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q215861 wdt:P577 ?answer } ORDER BY ASC(?answer) LIMIT 1\n",
      "Gold:  SELECT ?answer WHERE { wd:Q215861 wdt:P577 ?answer }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q130796 wdt:P571 ?date BIND (YEAR(?date) AS ?answer) }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q130796 wdt:P585 ?answer }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q4224189 wdt:P1191 ?date BIND (YEAR(?date) AS ?answer) }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q4224189 wdt:P577 ?answer }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q1355116 wdt:P837 ?date BIND(YEAR(?date) as ?answer) }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q1355116 wdt:P837 ?answer }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { ?answer wdt:P166 wd:Q38104 ?answer p:P166 [ pq:P585 ?date ] } ORDER BY ASC(?date) LIMIT 1\n",
      "Gold:  SELECT ?answer WHERE { wd:Q38104 p:P1346 [ps:P1346 ?answer; pq:P585 ?year] } ORDER BY ASC(?year) LIMIT 1\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q656 wdt:P571 ?date BIND (YEAR(?date) AS ?answer) }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q656 wdt:P571 ?answer }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q2635007 wdt:P974 ?answer }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q2635007 wdt:P403 ?answer }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q28937399 wdt:P577 ?answer } ORDER BY ASC(?answer) LIMIT 1\n",
      "Gold:  SELECT ?answer WHERE { wd:Q28937399 wdt:P577 ?answer }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q30134306 rdfs:label ?answer FILTER (lang(?answer) = \"en\") }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q30134306 wdt:P279 ?answer }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q35900 wdt:P569 ?date BIND(YEAR(?date) as ?answer) }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q35900 wdt:P569 ?answer }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q4132441 wdt:P576 ?date BIND(YEAR(?date) as ?answer) }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q4132441 wdt:P582 ?answer }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q319470 wdt:P410 ?answer }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q319470 wdt:P241 ?answer }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q1739453 wdt:P159 ?answer }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q1739453 wdt:P276 ?answer }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q48741246 wdt:P272 ?answer }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q48741246 wdt:P57 ?answer }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q2766 wdt:P400 ?answer }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q2766 wdt:P306 ?answer }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q597 p:P36 ?statement ?statement ps:P36 ?capital ?capital wdt:P17 ?answer }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q597 wdt:P1376 ?answer }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q175854 wdt:P828 ?answer }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q175854 wdt:P279 ?answer }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q192090 wdt:P38 ?answer }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q192090 wdt:P17 ?answer }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q2071077 wdt:P161 ?answer ?answer wdt:P1441 wd:Q51416 }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q51416 p:P161 [ ps:P161 ?answer; pq:P453 wd:Q2071077 ] }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q271270 p:P166/ps:P166 ?award ?award pq:P453 ?role ?role rdfs:label \"Nadia Sheveleva\"@en }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q271270 wdt:P166 ?answer }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { ?answer wdt:P161 wd:Q2373306 ?answer wdt:P453 wd:Q28664853 }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q2373306 p:P161 [ ps:P161 ?answer; pq:P453 wd:Q28664853 ] }\n",
      "\n",
      "Pred:  SELECT ?answer WHERE { wd:Q25328 wdt:P149 ?answer }\n",
      "Gold:  SELECT ?answer WHERE { wd:Q25328 wdt:P135 ?answer }\n",
      "\n",
      "Exact Match score:  0.53\n"
     ]
    }
   ],
   "source": [
    "golds = [sample['query'] for sample in chat_gpt_test_subsample[:]]\n",
    "\n",
    "exact_match = 0\n",
    "for pred, gold in zip(predicated_requests, golds):\n",
    "    result = compare_sparql_queries(pred, gold)\n",
    "    if result == False:\n",
    "        # print(pred)\n",
    "        # print(gold)\n",
    "        print('Pred: ', clean_sparql_query(pred))\n",
    "        print('Gold: ', clean_sparql_query(gold))\n",
    "        print()\n",
    "    exact_match += result\n",
    "    \n",
    "print('Exact Match score: ', exact_match / len(golds))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 173,
   "id": "802cbd7d-1750-4d53-9ae6-a6849ef6663b",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    },
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['SELECT ?answer \\nWHERE {\\n  wd:Q1710170 wdt:P149 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  ?answer wdt:P206 wd:Q179444 .\\n  ?answer wdt:P31 wd:Q5119\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q148 wdt:P36 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q170172 wdt:P119 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q812767 wdt:P740 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q30 wdt:P150 ?answer\\n}',\n",
       " 'SELECT ?answer\\nWHERE {\\n  wd:Q38111 wdt:P1477 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q1865 wdt:P1376 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q203002 wdt:P54 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q500951 wdt:P170 ?answer\\n}',\n",
       " 'SELECT ?answer\\nWHERE {\\n  wd:Q34216 rdfs:label ?answer .\\n  FILTER (lang(?answer) = \"ru\") .\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q44301 wdt:P463 ?answer .\\n  ?answer wdt:P31/wdt:P279 wd:Q215380\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n wd:Q151469 wdt:P571 ?answer .\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q148 wdt:P150 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n wd:Q3742244 wdt:P569 ?date .\\nBIND (YEAR(?date) AS ?answer).\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n wd:Q47170 wdt:P571 ?date .\\nBIND (YEAR(?date) AS ?answer).\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q19353 wdt:P118 ?answer\\n}',\n",
       " 'SELECT ?answer\\nWHERE {\\n  wd:Q913311 wdt:P161 ?answer .\\n  ?answer wdt:P31/wdt:P279* wd:Q215380\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q173540 wdt:P800 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q882 wdt:P26 [ wdt:P22 ?answer ].\\n}',\n",
       " 'SELECT ?answer\\nWHERE {\\n  wd:Q251918 wdt:P676 ?answer .\\n  FILTER (?answer not in ( wd:Q208116 ))\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q222 wdt:P17 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q3244512 wdt:P175 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q328079 wdt:P276 [ wdt:P131 ?answer ].\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q26428 wdt:P403 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q123280 wdt:P106 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q152043 wdt:P1303 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q1192679 wdt:P175 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q193292 wdt:P156 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q246 wdt:P112 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q7207 wdt:P53 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q445202 wdt:P2416 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n wd:Q677 wdt:P2101 ?answer .\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q488814 wdt:P991 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q39473 wdt:P17 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q270951 wdt:P40 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q7441771 wdt:P50 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q46602 wdt:P166 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q1055332 wdt:P57 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q43 wdt:P30 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q7747 wdt:P172 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q333048 wdt:P69 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q8475 wdt:P159 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q173985 wdt:P17 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q692989 wdt:P400 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n wd:Q41300 wdt:P571 ?date .\\nBIND (YEAR(?date) AS ?answer).\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n wd:Q1999930 wdt:P577 ?date .\\nBIND (YEAR(?date) AS ?answer).\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q41359 wdt:P50 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q233359 wdt:P97 ?answer\\n}',\n",
       " 'SELECT ?answer\\nWHERE {\\n  wd:Q48249 wdt:P710 ?answer .\\n  FILTER (?answer not in (wd:Q145))\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n wd:Q215861 wdt:P577 ?answer .\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n wd:Q130796 wdt:P585 ?answer .\\n}',\n",
       " 'SELECT ?answer\\nWHERE {\\n  wd:Q80299 wdt:P17 ?answer .\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n wd:Q4224189 wdt:P577 ?answer .\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q189509 wdt:P840 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q1355116 wdt:P837 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q9458 wdt:P119 ?answer\\n}',\n",
       " 'SELECT ?answer\\nWHERE {\\n  wd:Q38104 p:P1346 [ps:P1346 ?answer; pq:P585 ?year]\\n}\\nORDER BY ASC(?year)\\nLIMIT 1',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q142794 wdt:P54 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n wd:Q379079 wdt:P571 ?date .\\nBIND (YEAR(?date) AS ?answer).\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q2766 wdt:P176 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n wd:Q5484 wdt:P2046 ?answer .\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n wd:Q656 wdt:P571 ?answer .\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q2635007 wdt:P403 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n wd:Q478301 wdt:P582 ?answer .\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n wd:Q28937399 wdt:P577 ?answer .\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q30134306 wdt:P279 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n wd:Q2684 wdt:P571 ?date .\\nBIND (YEAR(?date) AS ?answer).\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n wd:Q35900 wdt:P569 ?answer .\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q302 wdt:P106 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q59536524 wdt:P136 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n wd:Q4132441 wdt:P582 ?answer .\\n}',\n",
       " 'SELECT ?answer\\nWHERE {\\n  wd:Q319470 wdt:P241 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q1739453 wdt:P276 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n wd:Q925 wdt:P2101 ?answer .\\n}',\n",
       " 'SELECT ?answer\\nWHERE {\\n  wd:Q5685 wdt:P20 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q48741246 wdt:P57 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q28 wdt:P36 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q2766 wdt:P306 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q597 wdt:P1376 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q221474 wdt:P61 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q175854 wdt:P279 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n wd:Q170770 wdt:P571 ?date .\\nBIND (YEAR(?date) AS ?answer).\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q112015 wdt:P50 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q52631 wdt:P17 ?answer\\n}',\n",
       " 'SELECT ?answer\\nWHERE {\\n  wd:Q192090 wdt:P17 ?answer .\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q131758 wdt:P2437 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n wd:Q134485 wdt:P4511 ?answer .\\n}',\n",
       " 'SELECT ?answer\\nWHERE {\\n  wd:Q51416 p:P161 [ ps:P161 ?answer; pq:P453 wd:Q2071077 ]\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n wd:Q23530 wdt:P2048 ?answer .\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q271270 wdt:P166 ?answer\\n}',\n",
       " 'SELECT ?answer\\nWHERE {\\n  wd:Q18813 wdt:P407 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q3526023 wdt:P2067 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q155174 wdt:P17 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q4341 wdt:P36 ?answer\\n}',\n",
       " 'SELECT ?answer\\nWHERE {\\n  wd:Q2373306 p:P161 [ ps:P161 ?answer; pq:P453 wd:Q28664853 ]\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q25328 wdt:P135 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q233 wdt:P206 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q58720 wdt:P69 ?answer\\n}',\n",
       " 'SELECT ?answer \\nWHERE {\\n  wd:Q11035 wdt:P61 ?answer\\n}']"
      ]
     },
     "execution_count": 173,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "golds"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 178,
   "id": "4ac5eb3b-f208-4d4f-bb65-75acf411d279",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    },
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[[...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...],\n",
       " [...]]"
      ]
     },
     "execution_count": 178,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "clean_gold_queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 179,
   "id": "e6aa3368-9d1c-43c4-97eb-bcd38875c68a",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "\n",
    "\n",
    "clean_pred_queries = []\n",
    "clean_gold_queries = []\n",
    "exact_match_list = []\n",
    "for pred, gold in zip(predicated_requests, golds):\n",
    "    \n",
    "    cleaned_pred = clean_sparql_query(pred)\n",
    "    cleaned_gold = clean_sparql_query(gold)\n",
    "    \n",
    "    clean_pred_queries.append(cleaned_pred)\n",
    "    clean_gold_queries.append(cleaned_gold)\n",
    "    \n",
    "    exact_match_list.append(cleaned_pred == cleaned_gold)\n",
    "    \n",
    "df = pd.DataFrame.from_dict({\"gold\": clean_gold_queries, \"pred\": clean_pred_queries, \"exact_match\": exact_match_list})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 183,
   "id": "392257eb-8284-4fe3-9f1c-0bef12c49d30",
   "metadata": {},
   "outputs": [],
   "source": [
    "df.to_csv(\"chat_gpt_as_kgqa_sample_11-12-24.tsv\", sep='\\t')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
